Revit 2027 API
FabricationPartSizeMap.WidthDiameter Property
 The width or diameter of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WidthDiameter { get; set; }
Public Property WidthDiameter As Double
	Get
	Set
public:
property double WidthDiameter {
	double get ();
	void set (double value);
}
member WidthDiameter : float with get, set
Property Value
Double
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace